In [1]:
import pandas as pd
import numpy as np

In [3]:
mi_indice = ['a', 'b', 'c', 'd', 'e' ]
mis_valores= [222,333,444,555,666 ]
dici={'a':222,'b':333,'c':444,'d':555,'e':666}

In [4]:
pd.Series(mis_valores)

0    222
1    333
2    444
3    555
4    666
dtype: int64

In [5]:
pd.Series(data=mis_valores, index=mi_indice)

a    222
b    333
c    444
d    555
e    666
dtype: int64

In [6]:
s=pd.Series(data=[10,20,30,40], index=['a','b','c','d'])

In [7]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
s.dtype

dtype('int64')

In [13]:
s.values
s[1]

C:\Users\legom\AppData\Local\Temp\ipykernel_20580\1378272815.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s[1]

20

In [14]:
s['a']

10

In [15]:
s.loc['a']

10

In [16]:
s[['a','c']
  ]

a    10
c    30
dtype: int64

In [17]:
s.loc[['a','c']]

a    10
c    30
dtype: int64

In [18]:
s1=pd.Series(data=[1,2,3,4],index=['a','b','c','d'])
s2=pd.Series(data=[10,20,30,40],index=['a','b','d','e'])

In [19]:
s1+s2

a    11.0
b    22.0
c     NaN
d    34.0
e     NaN
dtype: float64

In [20]:
s1.mean()

2.5

In [21]:
s1.median()

2.5

In [24]:
s1.max()

4

In [25]:
s1.std()

1.2909944487358056

In [26]:
s1.sort_values()

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
s1.sort_index()

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
ser_height = pd.Series([165.3, 170.1, 175.0, 182.1, 168.0, 162.0, 155.2, 176.9, 178.5, 176.1,
                        167.1, 180.0, 162.2, 176.1, 158.2, 168.6, 169.2])

In [29]:
ser_height.apply(lambda x: x / 100 )

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
dtype: float64

In [30]:
datos={'Name':['jake','mike','sara','lisa'],
       'Age':[28,34,29,42],
       'gender':['M','M','F','F']}
df=pd.DataFrame(datos)
df

   Name  Age gender
0  jake   28      M
1  mike   34      M
2  sara   29      F
3  lisa   42      F

In [31]:
df=pd.DataFrame(np.random.randn(10,5), columns=['A','B','C','D','E'])
df

          A         B         C         D         E
0  1.592158 -0.499855  0.246302 -1.189628  0.409880
1 -0.237776 -0.979817 -1.202839 -0.698689 -2.139532
2  1.850080 -0.890508  0.423449  0.167462  1.215844
3  1.901694  2.582613  0.454046 -0.176485  0.525638
4 -1.607121  0.911462  1.240808  0.848802  1.825631
5  1.435074  1.495924  0.132416  2.233772  0.749160
6 -0.459505  1.455506 -0.052225 -0.889189  0.051331
7  0.072932  0.298331 -0.013915  0.865423 -0.312590
8  0.778392 -0.480217  0.827439 -0.911134  1.638500
9  0.140559  1.017924 -1.310810  0.775740 -1.014910

In [38]:
df=pd.read_csv('data_studentlist.csv',header='infer')

In [39]:
df.head(5)

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

In [40]:
df.tail(5)

                name gender  age  grade absence bloodtype  height  weight
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [41]:
df.tail(5)

                name gender  age  grade absence bloodtype  height  weight
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
14      Linda Carter      F   22      2       N         B   158.2    45.2
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
16       Andrew King      M   21      1       N         A   169.2    62.2

In [46]:
forma=df.shape
print(forma[0])
print(df.shape[1])

17
8

In [43]:
df.columns

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       17 non-null     object
 1   gender     17 non-null     object
 2   age        17 non-null     int64
 3   grade      17 non-null     int64
 4   absence    17 non-null     object
 5   bloodtype  17 non-null     object
 6   height     17 non-null     float64
 7   weight     17 non-null     float64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.2+ KB

In [47]:
df.describe()

             age      grade      height     weight
count  17.000000  17.000000   17.000000  17.000000
mean   22.352941   2.294118  170.035294  61.064706
std     1.169464   1.104802    7.849756  11.851685
min    20.000000   1.000000  155.200000  45.200000
25%    22.000000   1.000000  165.300000  53.000000
50%    22.000000   2.000000  169.200000  61.300000
75%    23.000000   3.000000  176.100000  68.200000
max    24.000000   4.000000  182.100000  85.700000

In [48]:
df.name

0        Jared Diamond
1       Sarah O'Donnel
2         Brian Martin
3         David Hassel
4      Clara Rodriquez
5     Jennifer Lorentz
6          Susan Clark
7      Margareth Jones
8         John Bertsch
9       Jake Timmerman
10       Joshua Connor
11        John Matsuda
12        Eddy Johnson
13    Rebecah Anderson
14        Linda Carter
15      Richard Swayze
16         Andrew King
Name: name, dtype: object

In [49]:
df.name[3]

'David Hassel'

In [51]:
df.loc[:, ['name', 'gender']]

                name gender
0      Jared Diamond      M
1     Sarah O'Donnel      F
2       Brian Martin      M
3       David Hassel      M
4    Clara Rodriquez      F
5   Jennifer Lorentz      F
6        Susan Clark      F
7    Margareth Jones      F
8       John Bertsch      M
9     Jake Timmerman      M
10     Joshua Connor      M
11      John Matsuda      M
12      Eddy Johnson      M
13  Rebecah Anderson      F
14      Linda Carter      F
15    Richard Swayze      M
16       Andrew King      M

In [52]:
df.loc[1]

name         Sarah O'Donnel
gender                    F
age                      22
grade                     2
absence                   N
bloodtype                AB
height                170.1
weight                 53.0
Name: 1, dtype: object

In [53]:
header=df.columns
header

Index(['name', 'gender', 'age', 'grade', 'absence', 'bloodtype', 'height',
       'weight'],
      dtype='object')

In [54]:
df.loc[:,(header!='name') & (header!='gender')]

    age  grade absence bloodtype  height  weight
0    23      3       Y         O   165.3    68.2
1    22      2       N        AB   170.1    53.0
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
6    22      1       N         O   155.2    45.3
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
9    22      2       N         B   176.1    61.3
10   24      4       Y         O   167.1    62.0
11   22      2       N        AB   180.0    75.8
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
14   22      2       N         B   158.2    45.2
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [56]:
df.drop(columns=['name','gender'], inplace=True)

In [58]:
df[(df.age < 30) & (df.age != 22)]

    age  grade absence bloodtype  height  weight
0    23      3       Y         O   165.3    68.2
2    24      4       N         B   175.0    80.1
3    23      3       N        AB   182.1    85.7
4    20      1       Y         A   168.0    49.5
5    21      2       N         O   162.0    52.0
7    23      1       N         A   176.9    55.0
8    23      3       N         B   178.5    64.2
10   24      4       Y         O   167.1    62.0
12   21      1       N         A   162.2    55.3
13   23      3       N         O   176.1    53.1
15   24      4       Y         B   168.6    70.2
16   21      1       N         A   169.2    62.2

In [62]:
df.to_csv('data_studentlist_modified.csv', header='infer')